// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct AvatarImageLoaded_t {
 *     CSteamID m_steamID;
 *     int m_iImage;
 *     int m_iWide;
 *     int m_iTall;
 * }
 * }
 */
public class AvatarImageLoaded_t {

    AvatarImageLoaded_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat4j.C_LONG_LONG.withName("m_steamID"),
        SteamFlat4j.C_INT.withName("m_iImage"),
        SteamFlat4j.C_INT.withName("m_iWide"),
        SteamFlat4j.C_INT.withName("m_iTall"),
        MemoryLayout.paddingLayout(4)
    ).withName("AvatarImageLoaded_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong m_steamID$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_steamID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CSteamID m_steamID
     * }
     */
    public static final OfLong m_steamID$layout() {
        return m_steamID$LAYOUT;
    }

    private static final long m_steamID$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CSteamID m_steamID
     * }
     */
    public static final long m_steamID$offset() {
        return m_steamID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CSteamID m_steamID
     * }
     */
    public static long m_steamID(MemorySegment struct) {
        return struct.get(m_steamID$LAYOUT, m_steamID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CSteamID m_steamID
     * }
     */
    public static void m_steamID(MemorySegment struct, long fieldValue) {
        struct.set(m_steamID$LAYOUT, m_steamID$OFFSET, fieldValue);
    }

    private static final OfInt m_iImage$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_iImage"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int m_iImage
     * }
     */
    public static final OfInt m_iImage$layout() {
        return m_iImage$LAYOUT;
    }

    private static final long m_iImage$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int m_iImage
     * }
     */
    public static final long m_iImage$offset() {
        return m_iImage$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int m_iImage
     * }
     */
    public static int m_iImage(MemorySegment struct) {
        return struct.get(m_iImage$LAYOUT, m_iImage$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int m_iImage
     * }
     */
    public static void m_iImage(MemorySegment struct, int fieldValue) {
        struct.set(m_iImage$LAYOUT, m_iImage$OFFSET, fieldValue);
    }

    private static final OfInt m_iWide$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_iWide"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int m_iWide
     * }
     */
    public static final OfInt m_iWide$layout() {
        return m_iWide$LAYOUT;
    }

    private static final long m_iWide$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int m_iWide
     * }
     */
    public static final long m_iWide$offset() {
        return m_iWide$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int m_iWide
     * }
     */
    public static int m_iWide(MemorySegment struct) {
        return struct.get(m_iWide$LAYOUT, m_iWide$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int m_iWide
     * }
     */
    public static void m_iWide(MemorySegment struct, int fieldValue) {
        struct.set(m_iWide$LAYOUT, m_iWide$OFFSET, fieldValue);
    }

    private static final OfInt m_iTall$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_iTall"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int m_iTall
     * }
     */
    public static final OfInt m_iTall$layout() {
        return m_iTall$LAYOUT;
    }

    private static final long m_iTall$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int m_iTall
     * }
     */
    public static final long m_iTall$offset() {
        return m_iTall$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int m_iTall
     * }
     */
    public static int m_iTall(MemorySegment struct) {
        return struct.get(m_iTall$LAYOUT, m_iTall$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int m_iTall
     * }
     */
    public static void m_iTall(MemorySegment struct, int fieldValue) {
        struct.set(m_iTall$LAYOUT, m_iTall$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

