// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct GetUserItemVoteResult_t {
 *     PublishedFileId_t m_nPublishedFileId;
 *     EResult m_eResult;
 *     bool m_bVotedUp;
 *     bool m_bVotedDown;
 *     bool m_bVoteSkipped;
 * }
 * }
 */
public class GetUserItemVoteResult_t {

    GetUserItemVoteResult_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat4j.C_LONG_LONG.withName("m_nPublishedFileId"),
        SteamFlat4j.C_INT.withName("m_eResult"),
        SteamFlat4j.C_BOOL.withName("m_bVotedUp"),
        SteamFlat4j.C_BOOL.withName("m_bVotedDown"),
        SteamFlat4j.C_BOOL.withName("m_bVoteSkipped"),
        MemoryLayout.paddingLayout(1)
    ).withName("GetUserItemVoteResult_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong m_nPublishedFileId$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_nPublishedFileId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PublishedFileId_t m_nPublishedFileId
     * }
     */
    public static final OfLong m_nPublishedFileId$layout() {
        return m_nPublishedFileId$LAYOUT;
    }

    private static final long m_nPublishedFileId$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PublishedFileId_t m_nPublishedFileId
     * }
     */
    public static final long m_nPublishedFileId$offset() {
        return m_nPublishedFileId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PublishedFileId_t m_nPublishedFileId
     * }
     */
    public static long m_nPublishedFileId(MemorySegment struct) {
        return struct.get(m_nPublishedFileId$LAYOUT, m_nPublishedFileId$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PublishedFileId_t m_nPublishedFileId
     * }
     */
    public static void m_nPublishedFileId(MemorySegment struct, long fieldValue) {
        struct.set(m_nPublishedFileId$LAYOUT, m_nPublishedFileId$OFFSET, fieldValue);
    }

    private static final OfInt m_eResult$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_eResult"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final OfInt m_eResult$layout() {
        return m_eResult$LAYOUT;
    }

    private static final long m_eResult$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final long m_eResult$offset() {
        return m_eResult$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static int m_eResult(MemorySegment struct) {
        return struct.get(m_eResult$LAYOUT, m_eResult$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static void m_eResult(MemorySegment struct, int fieldValue) {
        struct.set(m_eResult$LAYOUT, m_eResult$OFFSET, fieldValue);
    }

    private static final OfBoolean m_bVotedUp$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("m_bVotedUp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool m_bVotedUp
     * }
     */
    public static final OfBoolean m_bVotedUp$layout() {
        return m_bVotedUp$LAYOUT;
    }

    private static final long m_bVotedUp$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool m_bVotedUp
     * }
     */
    public static final long m_bVotedUp$offset() {
        return m_bVotedUp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool m_bVotedUp
     * }
     */
    public static boolean m_bVotedUp(MemorySegment struct) {
        return struct.get(m_bVotedUp$LAYOUT, m_bVotedUp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool m_bVotedUp
     * }
     */
    public static void m_bVotedUp(MemorySegment struct, boolean fieldValue) {
        struct.set(m_bVotedUp$LAYOUT, m_bVotedUp$OFFSET, fieldValue);
    }

    private static final OfBoolean m_bVotedDown$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("m_bVotedDown"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool m_bVotedDown
     * }
     */
    public static final OfBoolean m_bVotedDown$layout() {
        return m_bVotedDown$LAYOUT;
    }

    private static final long m_bVotedDown$OFFSET = 13;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool m_bVotedDown
     * }
     */
    public static final long m_bVotedDown$offset() {
        return m_bVotedDown$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool m_bVotedDown
     * }
     */
    public static boolean m_bVotedDown(MemorySegment struct) {
        return struct.get(m_bVotedDown$LAYOUT, m_bVotedDown$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool m_bVotedDown
     * }
     */
    public static void m_bVotedDown(MemorySegment struct, boolean fieldValue) {
        struct.set(m_bVotedDown$LAYOUT, m_bVotedDown$OFFSET, fieldValue);
    }

    private static final OfBoolean m_bVoteSkipped$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("m_bVoteSkipped"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool m_bVoteSkipped
     * }
     */
    public static final OfBoolean m_bVoteSkipped$layout() {
        return m_bVoteSkipped$LAYOUT;
    }

    private static final long m_bVoteSkipped$OFFSET = 14;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool m_bVoteSkipped
     * }
     */
    public static final long m_bVoteSkipped$offset() {
        return m_bVoteSkipped$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool m_bVoteSkipped
     * }
     */
    public static boolean m_bVoteSkipped(MemorySegment struct) {
        return struct.get(m_bVoteSkipped$LAYOUT, m_bVoteSkipped$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool m_bVoteSkipped
     * }
     */
    public static void m_bVoteSkipped(MemorySegment struct, boolean fieldValue) {
        struct.set(m_bVoteSkipped$LAYOUT, m_bVoteSkipped$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

