// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct HTML_LinkAtPosition_t {
 *     HHTMLBrowser unBrowserHandle;
 *     uint32 x;
 *     uint32 y;
 *     const char *pchURL;
 *     bool bInput;
 *     bool bLiveLink;
 * }
 * }
 */
public class HTML_LinkAtPosition_t {

    HTML_LinkAtPosition_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat4j.C_INT.withName("unBrowserHandle"),
        SteamFlat4j.C_INT.withName("x"),
        SteamFlat4j.C_INT.withName("y"),
        MemoryLayout.paddingLayout(4),
        SteamFlat4j.C_POINTER.withName("pchURL"),
        SteamFlat4j.C_BOOL.withName("bInput"),
        SteamFlat4j.C_BOOL.withName("bLiveLink"),
        MemoryLayout.paddingLayout(6)
    ).withName("HTML_LinkAtPosition_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt unBrowserHandle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("unBrowserHandle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * HHTMLBrowser unBrowserHandle
     * }
     */
    public static final OfInt unBrowserHandle$layout() {
        return unBrowserHandle$LAYOUT;
    }

    private static final long unBrowserHandle$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * HHTMLBrowser unBrowserHandle
     * }
     */
    public static final long unBrowserHandle$offset() {
        return unBrowserHandle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * HHTMLBrowser unBrowserHandle
     * }
     */
    public static int unBrowserHandle(MemorySegment struct) {
        return struct.get(unBrowserHandle$LAYOUT, unBrowserHandle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * HHTMLBrowser unBrowserHandle
     * }
     */
    public static void unBrowserHandle(MemorySegment struct, int fieldValue) {
        struct.set(unBrowserHandle$LAYOUT, unBrowserHandle$OFFSET, fieldValue);
    }

    private static final OfInt x$LAYOUT = (OfInt)$LAYOUT.select(groupElement("x"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 x
     * }
     */
    public static final OfInt x$layout() {
        return x$LAYOUT;
    }

    private static final long x$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 x
     * }
     */
    public static final long x$offset() {
        return x$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 x
     * }
     */
    public static int x(MemorySegment struct) {
        return struct.get(x$LAYOUT, x$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 x
     * }
     */
    public static void x(MemorySegment struct, int fieldValue) {
        struct.set(x$LAYOUT, x$OFFSET, fieldValue);
    }

    private static final OfInt y$LAYOUT = (OfInt)$LAYOUT.select(groupElement("y"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 y
     * }
     */
    public static final OfInt y$layout() {
        return y$LAYOUT;
    }

    private static final long y$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 y
     * }
     */
    public static final long y$offset() {
        return y$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 y
     * }
     */
    public static int y(MemorySegment struct) {
        return struct.get(y$LAYOUT, y$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 y
     * }
     */
    public static void y(MemorySegment struct, int fieldValue) {
        struct.set(y$LAYOUT, y$OFFSET, fieldValue);
    }

    private static final AddressLayout pchURL$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pchURL"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *pchURL
     * }
     */
    public static final AddressLayout pchURL$layout() {
        return pchURL$LAYOUT;
    }

    private static final long pchURL$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *pchURL
     * }
     */
    public static final long pchURL$offset() {
        return pchURL$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *pchURL
     * }
     */
    public static MemorySegment pchURL(MemorySegment struct) {
        return struct.get(pchURL$LAYOUT, pchURL$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *pchURL
     * }
     */
    public static void pchURL(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pchURL$LAYOUT, pchURL$OFFSET, fieldValue);
    }

    private static final OfBoolean bInput$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("bInput"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool bInput
     * }
     */
    public static final OfBoolean bInput$layout() {
        return bInput$LAYOUT;
    }

    private static final long bInput$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool bInput
     * }
     */
    public static final long bInput$offset() {
        return bInput$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool bInput
     * }
     */
    public static boolean bInput(MemorySegment struct) {
        return struct.get(bInput$LAYOUT, bInput$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool bInput
     * }
     */
    public static void bInput(MemorySegment struct, boolean fieldValue) {
        struct.set(bInput$LAYOUT, bInput$OFFSET, fieldValue);
    }

    private static final OfBoolean bLiveLink$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("bLiveLink"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool bLiveLink
     * }
     */
    public static final OfBoolean bLiveLink$layout() {
        return bLiveLink$LAYOUT;
    }

    private static final long bLiveLink$OFFSET = 25;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool bLiveLink
     * }
     */
    public static final long bLiveLink$offset() {
        return bLiveLink$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool bLiveLink
     * }
     */
    public static boolean bLiveLink(MemorySegment struct) {
        return struct.get(bLiveLink$LAYOUT, bLiveLink$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool bLiveLink
     * }
     */
    public static void bLiveLink(MemorySegment struct, boolean fieldValue) {
        struct.set(bLiveLink$LAYOUT, bLiveLink$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

