// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct HTML_NewWindow_t {
 *     HHTMLBrowser unBrowserHandle;
 *     const char *pchURL;
 *     uint32 unX;
 *     uint32 unY;
 *     uint32 unWide;
 *     uint32 unTall;
 *     HHTMLBrowser unNewWindow_BrowserHandle_IGNORE;
 * }
 * }
 */
public class HTML_NewWindow_t {

    HTML_NewWindow_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat4j.C_INT.withName("unBrowserHandle"),
        MemoryLayout.paddingLayout(4),
        SteamFlat4j.C_POINTER.withName("pchURL"),
        SteamFlat4j.C_INT.withName("unX"),
        SteamFlat4j.C_INT.withName("unY"),
        SteamFlat4j.C_INT.withName("unWide"),
        SteamFlat4j.C_INT.withName("unTall"),
        SteamFlat4j.C_INT.withName("unNewWindow_BrowserHandle_IGNORE"),
        MemoryLayout.paddingLayout(4)
    ).withName("HTML_NewWindow_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt unBrowserHandle$LAYOUT = (OfInt)$LAYOUT.select(groupElement("unBrowserHandle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * HHTMLBrowser unBrowserHandle
     * }
     */
    public static final OfInt unBrowserHandle$layout() {
        return unBrowserHandle$LAYOUT;
    }

    private static final long unBrowserHandle$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * HHTMLBrowser unBrowserHandle
     * }
     */
    public static final long unBrowserHandle$offset() {
        return unBrowserHandle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * HHTMLBrowser unBrowserHandle
     * }
     */
    public static int unBrowserHandle(MemorySegment struct) {
        return struct.get(unBrowserHandle$LAYOUT, unBrowserHandle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * HHTMLBrowser unBrowserHandle
     * }
     */
    public static void unBrowserHandle(MemorySegment struct, int fieldValue) {
        struct.set(unBrowserHandle$LAYOUT, unBrowserHandle$OFFSET, fieldValue);
    }

    private static final AddressLayout pchURL$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pchURL"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *pchURL
     * }
     */
    public static final AddressLayout pchURL$layout() {
        return pchURL$LAYOUT;
    }

    private static final long pchURL$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *pchURL
     * }
     */
    public static final long pchURL$offset() {
        return pchURL$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *pchURL
     * }
     */
    public static MemorySegment pchURL(MemorySegment struct) {
        return struct.get(pchURL$LAYOUT, pchURL$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *pchURL
     * }
     */
    public static void pchURL(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pchURL$LAYOUT, pchURL$OFFSET, fieldValue);
    }

    private static final OfInt unX$LAYOUT = (OfInt)$LAYOUT.select(groupElement("unX"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 unX
     * }
     */
    public static final OfInt unX$layout() {
        return unX$LAYOUT;
    }

    private static final long unX$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 unX
     * }
     */
    public static final long unX$offset() {
        return unX$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 unX
     * }
     */
    public static int unX(MemorySegment struct) {
        return struct.get(unX$LAYOUT, unX$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 unX
     * }
     */
    public static void unX(MemorySegment struct, int fieldValue) {
        struct.set(unX$LAYOUT, unX$OFFSET, fieldValue);
    }

    private static final OfInt unY$LAYOUT = (OfInt)$LAYOUT.select(groupElement("unY"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 unY
     * }
     */
    public static final OfInt unY$layout() {
        return unY$LAYOUT;
    }

    private static final long unY$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 unY
     * }
     */
    public static final long unY$offset() {
        return unY$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 unY
     * }
     */
    public static int unY(MemorySegment struct) {
        return struct.get(unY$LAYOUT, unY$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 unY
     * }
     */
    public static void unY(MemorySegment struct, int fieldValue) {
        struct.set(unY$LAYOUT, unY$OFFSET, fieldValue);
    }

    private static final OfInt unWide$LAYOUT = (OfInt)$LAYOUT.select(groupElement("unWide"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 unWide
     * }
     */
    public static final OfInt unWide$layout() {
        return unWide$LAYOUT;
    }

    private static final long unWide$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 unWide
     * }
     */
    public static final long unWide$offset() {
        return unWide$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 unWide
     * }
     */
    public static int unWide(MemorySegment struct) {
        return struct.get(unWide$LAYOUT, unWide$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 unWide
     * }
     */
    public static void unWide(MemorySegment struct, int fieldValue) {
        struct.set(unWide$LAYOUT, unWide$OFFSET, fieldValue);
    }

    private static final OfInt unTall$LAYOUT = (OfInt)$LAYOUT.select(groupElement("unTall"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 unTall
     * }
     */
    public static final OfInt unTall$layout() {
        return unTall$LAYOUT;
    }

    private static final long unTall$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 unTall
     * }
     */
    public static final long unTall$offset() {
        return unTall$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 unTall
     * }
     */
    public static int unTall(MemorySegment struct) {
        return struct.get(unTall$LAYOUT, unTall$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 unTall
     * }
     */
    public static void unTall(MemorySegment struct, int fieldValue) {
        struct.set(unTall$LAYOUT, unTall$OFFSET, fieldValue);
    }

    private static final OfInt unNewWindow_BrowserHandle_IGNORE$LAYOUT = (OfInt)$LAYOUT.select(groupElement("unNewWindow_BrowserHandle_IGNORE"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * HHTMLBrowser unNewWindow_BrowserHandle_IGNORE
     * }
     */
    public static final OfInt unNewWindow_BrowserHandle_IGNORE$layout() {
        return unNewWindow_BrowserHandle_IGNORE$LAYOUT;
    }

    private static final long unNewWindow_BrowserHandle_IGNORE$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * HHTMLBrowser unNewWindow_BrowserHandle_IGNORE
     * }
     */
    public static final long unNewWindow_BrowserHandle_IGNORE$offset() {
        return unNewWindow_BrowserHandle_IGNORE$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * HHTMLBrowser unNewWindow_BrowserHandle_IGNORE
     * }
     */
    public static int unNewWindow_BrowserHandle_IGNORE(MemorySegment struct) {
        return struct.get(unNewWindow_BrowserHandle_IGNORE$LAYOUT, unNewWindow_BrowserHandle_IGNORE$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * HHTMLBrowser unNewWindow_BrowserHandle_IGNORE
     * }
     */
    public static void unNewWindow_BrowserHandle_IGNORE(MemorySegment struct, int fieldValue) {
        struct.set(unNewWindow_BrowserHandle_IGNORE$LAYOUT, unNewWindow_BrowserHandle_IGNORE$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

