// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct LeaderboardEntry_t {
 *     CSteamID m_steamIDUser;
 *     int32 m_nGlobalRank;
 *     int32 m_nScore;
 *     int32 m_cDetails;
 *     UGCHandle_t m_hUGC;
 * }
 * }
 */
public class LeaderboardEntry_t {

    LeaderboardEntry_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat4j.C_LONG_LONG.withName("m_steamIDUser"),
        SteamFlat4j.C_INT.withName("m_nGlobalRank"),
        SteamFlat4j.C_INT.withName("m_nScore"),
        SteamFlat4j.C_INT.withName("m_cDetails"),
        MemoryLayout.paddingLayout(4),
        SteamFlat4j.C_LONG_LONG.withName("m_hUGC")
    ).withName("LeaderboardEntry_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong m_steamIDUser$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_steamIDUser"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDUser
     * }
     */
    public static final OfLong m_steamIDUser$layout() {
        return m_steamIDUser$LAYOUT;
    }

    private static final long m_steamIDUser$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDUser
     * }
     */
    public static final long m_steamIDUser$offset() {
        return m_steamIDUser$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDUser
     * }
     */
    public static long m_steamIDUser(MemorySegment struct) {
        return struct.get(m_steamIDUser$LAYOUT, m_steamIDUser$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDUser
     * }
     */
    public static void m_steamIDUser(MemorySegment struct, long fieldValue) {
        struct.set(m_steamIDUser$LAYOUT, m_steamIDUser$OFFSET, fieldValue);
    }

    private static final OfInt m_nGlobalRank$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_nGlobalRank"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32 m_nGlobalRank
     * }
     */
    public static final OfInt m_nGlobalRank$layout() {
        return m_nGlobalRank$LAYOUT;
    }

    private static final long m_nGlobalRank$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32 m_nGlobalRank
     * }
     */
    public static final long m_nGlobalRank$offset() {
        return m_nGlobalRank$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32 m_nGlobalRank
     * }
     */
    public static int m_nGlobalRank(MemorySegment struct) {
        return struct.get(m_nGlobalRank$LAYOUT, m_nGlobalRank$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32 m_nGlobalRank
     * }
     */
    public static void m_nGlobalRank(MemorySegment struct, int fieldValue) {
        struct.set(m_nGlobalRank$LAYOUT, m_nGlobalRank$OFFSET, fieldValue);
    }

    private static final OfInt m_nScore$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_nScore"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32 m_nScore
     * }
     */
    public static final OfInt m_nScore$layout() {
        return m_nScore$LAYOUT;
    }

    private static final long m_nScore$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32 m_nScore
     * }
     */
    public static final long m_nScore$offset() {
        return m_nScore$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32 m_nScore
     * }
     */
    public static int m_nScore(MemorySegment struct) {
        return struct.get(m_nScore$LAYOUT, m_nScore$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32 m_nScore
     * }
     */
    public static void m_nScore(MemorySegment struct, int fieldValue) {
        struct.set(m_nScore$LAYOUT, m_nScore$OFFSET, fieldValue);
    }

    private static final OfInt m_cDetails$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_cDetails"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32 m_cDetails
     * }
     */
    public static final OfInt m_cDetails$layout() {
        return m_cDetails$LAYOUT;
    }

    private static final long m_cDetails$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32 m_cDetails
     * }
     */
    public static final long m_cDetails$offset() {
        return m_cDetails$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32 m_cDetails
     * }
     */
    public static int m_cDetails(MemorySegment struct) {
        return struct.get(m_cDetails$LAYOUT, m_cDetails$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32 m_cDetails
     * }
     */
    public static void m_cDetails(MemorySegment struct, int fieldValue) {
        struct.set(m_cDetails$LAYOUT, m_cDetails$OFFSET, fieldValue);
    }

    private static final OfLong m_hUGC$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_hUGC"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * UGCHandle_t m_hUGC
     * }
     */
    public static final OfLong m_hUGC$layout() {
        return m_hUGC$LAYOUT;
    }

    private static final long m_hUGC$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * UGCHandle_t m_hUGC
     * }
     */
    public static final long m_hUGC$offset() {
        return m_hUGC$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * UGCHandle_t m_hUGC
     * }
     */
    public static long m_hUGC(MemorySegment struct) {
        return struct.get(m_hUGC$LAYOUT, m_hUGC$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * UGCHandle_t m_hUGC
     * }
     */
    public static void m_hUGC(MemorySegment struct, long fieldValue) {
        struct.set(m_hUGC$LAYOUT, m_hUGC$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

