// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct LobbyEnter_t {
 *     uint64 m_ulSteamIDLobby;
 *     uint32 m_rgfChatPermissions;
 *     bool m_bLocked;
 *     uint32 m_EChatRoomEnterResponse;
 * }
 * }
 */
public class LobbyEnter_t {

    LobbyEnter_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat4j.C_LONG_LONG.withName("m_ulSteamIDLobby"),
        SteamFlat4j.C_INT.withName("m_rgfChatPermissions"),
        SteamFlat4j.C_BOOL.withName("m_bLocked"),
        MemoryLayout.paddingLayout(3),
        SteamFlat4j.C_INT.withName("m_EChatRoomEnterResponse"),
        MemoryLayout.paddingLayout(4)
    ).withName("LobbyEnter_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong m_ulSteamIDLobby$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulSteamIDLobby"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static final OfLong m_ulSteamIDLobby$layout() {
        return m_ulSteamIDLobby$LAYOUT;
    }

    private static final long m_ulSteamIDLobby$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static final long m_ulSteamIDLobby$offset() {
        return m_ulSteamIDLobby$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static long m_ulSteamIDLobby(MemorySegment struct) {
        return struct.get(m_ulSteamIDLobby$LAYOUT, m_ulSteamIDLobby$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static void m_ulSteamIDLobby(MemorySegment struct, long fieldValue) {
        struct.set(m_ulSteamIDLobby$LAYOUT, m_ulSteamIDLobby$OFFSET, fieldValue);
    }

    private static final OfInt m_rgfChatPermissions$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_rgfChatPermissions"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 m_rgfChatPermissions
     * }
     */
    public static final OfInt m_rgfChatPermissions$layout() {
        return m_rgfChatPermissions$LAYOUT;
    }

    private static final long m_rgfChatPermissions$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 m_rgfChatPermissions
     * }
     */
    public static final long m_rgfChatPermissions$offset() {
        return m_rgfChatPermissions$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 m_rgfChatPermissions
     * }
     */
    public static int m_rgfChatPermissions(MemorySegment struct) {
        return struct.get(m_rgfChatPermissions$LAYOUT, m_rgfChatPermissions$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 m_rgfChatPermissions
     * }
     */
    public static void m_rgfChatPermissions(MemorySegment struct, int fieldValue) {
        struct.set(m_rgfChatPermissions$LAYOUT, m_rgfChatPermissions$OFFSET, fieldValue);
    }

    private static final OfBoolean m_bLocked$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("m_bLocked"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool m_bLocked
     * }
     */
    public static final OfBoolean m_bLocked$layout() {
        return m_bLocked$LAYOUT;
    }

    private static final long m_bLocked$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool m_bLocked
     * }
     */
    public static final long m_bLocked$offset() {
        return m_bLocked$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool m_bLocked
     * }
     */
    public static boolean m_bLocked(MemorySegment struct) {
        return struct.get(m_bLocked$LAYOUT, m_bLocked$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool m_bLocked
     * }
     */
    public static void m_bLocked(MemorySegment struct, boolean fieldValue) {
        struct.set(m_bLocked$LAYOUT, m_bLocked$OFFSET, fieldValue);
    }

    private static final OfInt m_EChatRoomEnterResponse$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_EChatRoomEnterResponse"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 m_EChatRoomEnterResponse
     * }
     */
    public static final OfInt m_EChatRoomEnterResponse$layout() {
        return m_EChatRoomEnterResponse$LAYOUT;
    }

    private static final long m_EChatRoomEnterResponse$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 m_EChatRoomEnterResponse
     * }
     */
    public static final long m_EChatRoomEnterResponse$offset() {
        return m_EChatRoomEnterResponse$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 m_EChatRoomEnterResponse
     * }
     */
    public static int m_EChatRoomEnterResponse(MemorySegment struct) {
        return struct.get(m_EChatRoomEnterResponse$LAYOUT, m_EChatRoomEnterResponse$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 m_EChatRoomEnterResponse
     * }
     */
    public static void m_EChatRoomEnterResponse(MemorySegment struct, int fieldValue) {
        struct.set(m_EChatRoomEnterResponse$LAYOUT, m_EChatRoomEnterResponse$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

