// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct LobbyChatMsg_t {
 *     uint64 m_ulSteamIDLobby;
 *     uint64 m_ulSteamIDUser;
 *     uint8 m_eChatEntryType;
 *     uint32 m_iChatID;
 * }
 * }
 */
public class LobbyChatMsg_t {

    LobbyChatMsg_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat4j.C_LONG_LONG.withName("m_ulSteamIDLobby"),
        SteamFlat4j.C_LONG_LONG.withName("m_ulSteamIDUser"),
        SteamFlat4j.C_CHAR.withName("m_eChatEntryType"),
        MemoryLayout.paddingLayout(3),
        SteamFlat4j.C_INT.withName("m_iChatID")
    ).withName("LobbyChatMsg_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong m_ulSteamIDLobby$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulSteamIDLobby"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static final OfLong m_ulSteamIDLobby$layout() {
        return m_ulSteamIDLobby$LAYOUT;
    }

    private static final long m_ulSteamIDLobby$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static final long m_ulSteamIDLobby$offset() {
        return m_ulSteamIDLobby$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static long m_ulSteamIDLobby(MemorySegment struct) {
        return struct.get(m_ulSteamIDLobby$LAYOUT, m_ulSteamIDLobby$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static void m_ulSteamIDLobby(MemorySegment struct, long fieldValue) {
        struct.set(m_ulSteamIDLobby$LAYOUT, m_ulSteamIDLobby$OFFSET, fieldValue);
    }

    private static final OfLong m_ulSteamIDUser$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulSteamIDUser"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDUser
     * }
     */
    public static final OfLong m_ulSteamIDUser$layout() {
        return m_ulSteamIDUser$LAYOUT;
    }

    private static final long m_ulSteamIDUser$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDUser
     * }
     */
    public static final long m_ulSteamIDUser$offset() {
        return m_ulSteamIDUser$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDUser
     * }
     */
    public static long m_ulSteamIDUser(MemorySegment struct) {
        return struct.get(m_ulSteamIDUser$LAYOUT, m_ulSteamIDUser$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDUser
     * }
     */
    public static void m_ulSteamIDUser(MemorySegment struct, long fieldValue) {
        struct.set(m_ulSteamIDUser$LAYOUT, m_ulSteamIDUser$OFFSET, fieldValue);
    }

    private static final OfByte m_eChatEntryType$LAYOUT = (OfByte)$LAYOUT.select(groupElement("m_eChatEntryType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8 m_eChatEntryType
     * }
     */
    public static final OfByte m_eChatEntryType$layout() {
        return m_eChatEntryType$LAYOUT;
    }

    private static final long m_eChatEntryType$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8 m_eChatEntryType
     * }
     */
    public static final long m_eChatEntryType$offset() {
        return m_eChatEntryType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8 m_eChatEntryType
     * }
     */
    public static byte m_eChatEntryType(MemorySegment struct) {
        return struct.get(m_eChatEntryType$LAYOUT, m_eChatEntryType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8 m_eChatEntryType
     * }
     */
    public static void m_eChatEntryType(MemorySegment struct, byte fieldValue) {
        struct.set(m_eChatEntryType$LAYOUT, m_eChatEntryType$OFFSET, fieldValue);
    }

    private static final OfInt m_iChatID$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_iChatID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 m_iChatID
     * }
     */
    public static final OfInt m_iChatID$layout() {
        return m_iChatID$LAYOUT;
    }

    private static final long m_iChatID$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 m_iChatID
     * }
     */
    public static final long m_iChatID$offset() {
        return m_iChatID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 m_iChatID
     * }
     */
    public static int m_iChatID(MemorySegment struct) {
        return struct.get(m_iChatID$LAYOUT, m_iChatID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 m_iChatID
     * }
     */
    public static void m_iChatID(MemorySegment struct, int fieldValue) {
        struct.set(m_iChatID$LAYOUT, m_iChatID$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

