// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct RemoteStorageEnumerateUserSubscribedFilesResult_t {
 *     EResult m_eResult;
 *     int32 m_nResultsReturned;
 *     int32 m_nTotalResultCount;
 *     PublishedFileId_t m_rgPublishedFileId[50];
 *     uint32 m_rgRTimeSubscribed[50];
 * }
 * }
 */
public class RemoteStorageEnumerateUserSubscribedFilesResult_t {

    RemoteStorageEnumerateUserSubscribedFilesResult_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat4j.C_INT.withName("m_eResult"),
        SteamFlat4j.C_INT.withName("m_nResultsReturned"),
        SteamFlat4j.C_INT.withName("m_nTotalResultCount"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.sequenceLayout(50, SteamFlat4j.C_LONG_LONG).withName("m_rgPublishedFileId"),
        MemoryLayout.sequenceLayout(50, SteamFlat4j.C_INT).withName("m_rgRTimeSubscribed")
    ).withName("RemoteStorageEnumerateUserSubscribedFilesResult_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt m_eResult$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_eResult"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final OfInt m_eResult$layout() {
        return m_eResult$LAYOUT;
    }

    private static final long m_eResult$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final long m_eResult$offset() {
        return m_eResult$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static int m_eResult(MemorySegment struct) {
        return struct.get(m_eResult$LAYOUT, m_eResult$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static void m_eResult(MemorySegment struct, int fieldValue) {
        struct.set(m_eResult$LAYOUT, m_eResult$OFFSET, fieldValue);
    }

    private static final OfInt m_nResultsReturned$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_nResultsReturned"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32 m_nResultsReturned
     * }
     */
    public static final OfInt m_nResultsReturned$layout() {
        return m_nResultsReturned$LAYOUT;
    }

    private static final long m_nResultsReturned$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32 m_nResultsReturned
     * }
     */
    public static final long m_nResultsReturned$offset() {
        return m_nResultsReturned$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32 m_nResultsReturned
     * }
     */
    public static int m_nResultsReturned(MemorySegment struct) {
        return struct.get(m_nResultsReturned$LAYOUT, m_nResultsReturned$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32 m_nResultsReturned
     * }
     */
    public static void m_nResultsReturned(MemorySegment struct, int fieldValue) {
        struct.set(m_nResultsReturned$LAYOUT, m_nResultsReturned$OFFSET, fieldValue);
    }

    private static final OfInt m_nTotalResultCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_nTotalResultCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32 m_nTotalResultCount
     * }
     */
    public static final OfInt m_nTotalResultCount$layout() {
        return m_nTotalResultCount$LAYOUT;
    }

    private static final long m_nTotalResultCount$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32 m_nTotalResultCount
     * }
     */
    public static final long m_nTotalResultCount$offset() {
        return m_nTotalResultCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32 m_nTotalResultCount
     * }
     */
    public static int m_nTotalResultCount(MemorySegment struct) {
        return struct.get(m_nTotalResultCount$LAYOUT, m_nTotalResultCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32 m_nTotalResultCount
     * }
     */
    public static void m_nTotalResultCount(MemorySegment struct, int fieldValue) {
        struct.set(m_nTotalResultCount$LAYOUT, m_nTotalResultCount$OFFSET, fieldValue);
    }

    private static final SequenceLayout m_rgPublishedFileId$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("m_rgPublishedFileId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PublishedFileId_t m_rgPublishedFileId[50]
     * }
     */
    public static final SequenceLayout m_rgPublishedFileId$layout() {
        return m_rgPublishedFileId$LAYOUT;
    }

    private static final long m_rgPublishedFileId$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PublishedFileId_t m_rgPublishedFileId[50]
     * }
     */
    public static final long m_rgPublishedFileId$offset() {
        return m_rgPublishedFileId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PublishedFileId_t m_rgPublishedFileId[50]
     * }
     */
    public static MemorySegment m_rgPublishedFileId(MemorySegment struct) {
        return struct.asSlice(m_rgPublishedFileId$OFFSET, m_rgPublishedFileId$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PublishedFileId_t m_rgPublishedFileId[50]
     * }
     */
    public static void m_rgPublishedFileId(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, m_rgPublishedFileId$OFFSET, m_rgPublishedFileId$LAYOUT.byteSize());
    }

    private static long[] m_rgPublishedFileId$DIMS = { 50 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * PublishedFileId_t m_rgPublishedFileId[50]
     * }
     */
    public static long[] m_rgPublishedFileId$dimensions() {
        return m_rgPublishedFileId$DIMS;
    }
    private static final VarHandle m_rgPublishedFileId$ELEM_HANDLE = m_rgPublishedFileId$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * PublishedFileId_t m_rgPublishedFileId[50]
     * }
     */
    public static long m_rgPublishedFileId(MemorySegment struct, long index0) {
        return (long)m_rgPublishedFileId$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * PublishedFileId_t m_rgPublishedFileId[50]
     * }
     */
    public static void m_rgPublishedFileId(MemorySegment struct, long index0, long fieldValue) {
        m_rgPublishedFileId$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout m_rgRTimeSubscribed$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("m_rgRTimeSubscribed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 m_rgRTimeSubscribed[50]
     * }
     */
    public static final SequenceLayout m_rgRTimeSubscribed$layout() {
        return m_rgRTimeSubscribed$LAYOUT;
    }

    private static final long m_rgRTimeSubscribed$OFFSET = 416;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 m_rgRTimeSubscribed[50]
     * }
     */
    public static final long m_rgRTimeSubscribed$offset() {
        return m_rgRTimeSubscribed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 m_rgRTimeSubscribed[50]
     * }
     */
    public static MemorySegment m_rgRTimeSubscribed(MemorySegment struct) {
        return struct.asSlice(m_rgRTimeSubscribed$OFFSET, m_rgRTimeSubscribed$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 m_rgRTimeSubscribed[50]
     * }
     */
    public static void m_rgRTimeSubscribed(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, m_rgRTimeSubscribed$OFFSET, m_rgRTimeSubscribed$LAYOUT.byteSize());
    }

    private static long[] m_rgRTimeSubscribed$DIMS = { 50 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint32 m_rgRTimeSubscribed[50]
     * }
     */
    public static long[] m_rgRTimeSubscribed$dimensions() {
        return m_rgRTimeSubscribed$DIMS;
    }
    private static final VarHandle m_rgRTimeSubscribed$ELEM_HANDLE = m_rgRTimeSubscribed$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint32 m_rgRTimeSubscribed[50]
     * }
     */
    public static int m_rgRTimeSubscribed(MemorySegment struct, long index0) {
        return (int)m_rgRTimeSubscribed$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint32 m_rgRTimeSubscribed[50]
     * }
     */
    public static void m_rgRTimeSubscribed(MemorySegment struct, long index0, int fieldValue) {
        m_rgRTimeSubscribed$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

