// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct SearchForGameResultCallback_t {
 *     uint64 m_ullSearchID;
 *     EResult m_eResult;
 *     int32 m_nCountPlayersInGame;
 *     int32 m_nCountAcceptedGame;
 *     CSteamID m_steamIDHost;
 *     bool m_bFinalCallback;
 * }
 * }
 */
public class SearchForGameResultCallback_t {

    SearchForGameResultCallback_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat4j.C_LONG_LONG.withName("m_ullSearchID"),
        SteamFlat4j.C_INT.withName("m_eResult"),
        SteamFlat4j.C_INT.withName("m_nCountPlayersInGame"),
        SteamFlat4j.C_INT.withName("m_nCountAcceptedGame"),
        MemoryLayout.paddingLayout(4),
        SteamFlat4j.C_LONG_LONG.withName("m_steamIDHost"),
        SteamFlat4j.C_BOOL.withName("m_bFinalCallback"),
        MemoryLayout.paddingLayout(7)
    ).withName("SearchForGameResultCallback_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong m_ullSearchID$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ullSearchID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64 m_ullSearchID
     * }
     */
    public static final OfLong m_ullSearchID$layout() {
        return m_ullSearchID$LAYOUT;
    }

    private static final long m_ullSearchID$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64 m_ullSearchID
     * }
     */
    public static final long m_ullSearchID$offset() {
        return m_ullSearchID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64 m_ullSearchID
     * }
     */
    public static long m_ullSearchID(MemorySegment struct) {
        return struct.get(m_ullSearchID$LAYOUT, m_ullSearchID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64 m_ullSearchID
     * }
     */
    public static void m_ullSearchID(MemorySegment struct, long fieldValue) {
        struct.set(m_ullSearchID$LAYOUT, m_ullSearchID$OFFSET, fieldValue);
    }

    private static final OfInt m_eResult$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_eResult"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final OfInt m_eResult$layout() {
        return m_eResult$LAYOUT;
    }

    private static final long m_eResult$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final long m_eResult$offset() {
        return m_eResult$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static int m_eResult(MemorySegment struct) {
        return struct.get(m_eResult$LAYOUT, m_eResult$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static void m_eResult(MemorySegment struct, int fieldValue) {
        struct.set(m_eResult$LAYOUT, m_eResult$OFFSET, fieldValue);
    }

    private static final OfInt m_nCountPlayersInGame$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_nCountPlayersInGame"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32 m_nCountPlayersInGame
     * }
     */
    public static final OfInt m_nCountPlayersInGame$layout() {
        return m_nCountPlayersInGame$LAYOUT;
    }

    private static final long m_nCountPlayersInGame$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32 m_nCountPlayersInGame
     * }
     */
    public static final long m_nCountPlayersInGame$offset() {
        return m_nCountPlayersInGame$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32 m_nCountPlayersInGame
     * }
     */
    public static int m_nCountPlayersInGame(MemorySegment struct) {
        return struct.get(m_nCountPlayersInGame$LAYOUT, m_nCountPlayersInGame$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32 m_nCountPlayersInGame
     * }
     */
    public static void m_nCountPlayersInGame(MemorySegment struct, int fieldValue) {
        struct.set(m_nCountPlayersInGame$LAYOUT, m_nCountPlayersInGame$OFFSET, fieldValue);
    }

    private static final OfInt m_nCountAcceptedGame$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_nCountAcceptedGame"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32 m_nCountAcceptedGame
     * }
     */
    public static final OfInt m_nCountAcceptedGame$layout() {
        return m_nCountAcceptedGame$LAYOUT;
    }

    private static final long m_nCountAcceptedGame$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32 m_nCountAcceptedGame
     * }
     */
    public static final long m_nCountAcceptedGame$offset() {
        return m_nCountAcceptedGame$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32 m_nCountAcceptedGame
     * }
     */
    public static int m_nCountAcceptedGame(MemorySegment struct) {
        return struct.get(m_nCountAcceptedGame$LAYOUT, m_nCountAcceptedGame$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32 m_nCountAcceptedGame
     * }
     */
    public static void m_nCountAcceptedGame(MemorySegment struct, int fieldValue) {
        struct.set(m_nCountAcceptedGame$LAYOUT, m_nCountAcceptedGame$OFFSET, fieldValue);
    }

    private static final OfLong m_steamIDHost$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_steamIDHost"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDHost
     * }
     */
    public static final OfLong m_steamIDHost$layout() {
        return m_steamIDHost$LAYOUT;
    }

    private static final long m_steamIDHost$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDHost
     * }
     */
    public static final long m_steamIDHost$offset() {
        return m_steamIDHost$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDHost
     * }
     */
    public static long m_steamIDHost(MemorySegment struct) {
        return struct.get(m_steamIDHost$LAYOUT, m_steamIDHost$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDHost
     * }
     */
    public static void m_steamIDHost(MemorySegment struct, long fieldValue) {
        struct.set(m_steamIDHost$LAYOUT, m_steamIDHost$OFFSET, fieldValue);
    }

    private static final OfBoolean m_bFinalCallback$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("m_bFinalCallback"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool m_bFinalCallback
     * }
     */
    public static final OfBoolean m_bFinalCallback$layout() {
        return m_bFinalCallback$LAYOUT;
    }

    private static final long m_bFinalCallback$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool m_bFinalCallback
     * }
     */
    public static final long m_bFinalCallback$offset() {
        return m_bFinalCallback$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool m_bFinalCallback
     * }
     */
    public static boolean m_bFinalCallback(MemorySegment struct) {
        return struct.get(m_bFinalCallback$LAYOUT, m_bFinalCallback$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool m_bFinalCallback
     * }
     */
    public static void m_bFinalCallback(MemorySegment struct, boolean fieldValue) {
        struct.set(m_bFinalCallback$LAYOUT, m_bFinalCallback$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

