// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct SocketStatusCallback_t {
 *     SNetSocket_t m_hSocket;
 *     SNetListenSocket_t m_hListenSocket;
 *     CSteamID m_steamIDRemote;
 *     int m_eSNetSocketState;
 * }
 * }
 */
public class SocketStatusCallback_t {

    SocketStatusCallback_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat4j.C_INT.withName("m_hSocket"),
        SteamFlat4j.C_INT.withName("m_hListenSocket"),
        SteamFlat4j.C_LONG_LONG.withName("m_steamIDRemote"),
        SteamFlat4j.C_INT.withName("m_eSNetSocketState"),
        MemoryLayout.paddingLayout(4)
    ).withName("SocketStatusCallback_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt m_hSocket$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_hSocket"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * SNetSocket_t m_hSocket
     * }
     */
    public static final OfInt m_hSocket$layout() {
        return m_hSocket$LAYOUT;
    }

    private static final long m_hSocket$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * SNetSocket_t m_hSocket
     * }
     */
    public static final long m_hSocket$offset() {
        return m_hSocket$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * SNetSocket_t m_hSocket
     * }
     */
    public static int m_hSocket(MemorySegment struct) {
        return struct.get(m_hSocket$LAYOUT, m_hSocket$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * SNetSocket_t m_hSocket
     * }
     */
    public static void m_hSocket(MemorySegment struct, int fieldValue) {
        struct.set(m_hSocket$LAYOUT, m_hSocket$OFFSET, fieldValue);
    }

    private static final OfInt m_hListenSocket$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_hListenSocket"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * SNetListenSocket_t m_hListenSocket
     * }
     */
    public static final OfInt m_hListenSocket$layout() {
        return m_hListenSocket$LAYOUT;
    }

    private static final long m_hListenSocket$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * SNetListenSocket_t m_hListenSocket
     * }
     */
    public static final long m_hListenSocket$offset() {
        return m_hListenSocket$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * SNetListenSocket_t m_hListenSocket
     * }
     */
    public static int m_hListenSocket(MemorySegment struct) {
        return struct.get(m_hListenSocket$LAYOUT, m_hListenSocket$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * SNetListenSocket_t m_hListenSocket
     * }
     */
    public static void m_hListenSocket(MemorySegment struct, int fieldValue) {
        struct.set(m_hListenSocket$LAYOUT, m_hListenSocket$OFFSET, fieldValue);
    }

    private static final OfLong m_steamIDRemote$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_steamIDRemote"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDRemote
     * }
     */
    public static final OfLong m_steamIDRemote$layout() {
        return m_steamIDRemote$LAYOUT;
    }

    private static final long m_steamIDRemote$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDRemote
     * }
     */
    public static final long m_steamIDRemote$offset() {
        return m_steamIDRemote$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDRemote
     * }
     */
    public static long m_steamIDRemote(MemorySegment struct) {
        return struct.get(m_steamIDRemote$LAYOUT, m_steamIDRemote$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDRemote
     * }
     */
    public static void m_steamIDRemote(MemorySegment struct, long fieldValue) {
        struct.set(m_steamIDRemote$LAYOUT, m_steamIDRemote$OFFSET, fieldValue);
    }

    private static final OfInt m_eSNetSocketState$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_eSNetSocketState"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int m_eSNetSocketState
     * }
     */
    public static final OfInt m_eSNetSocketState$layout() {
        return m_eSNetSocketState$LAYOUT;
    }

    private static final long m_eSNetSocketState$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int m_eSNetSocketState
     * }
     */
    public static final long m_eSNetSocketState$offset() {
        return m_eSNetSocketState$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int m_eSNetSocketState
     * }
     */
    public static int m_eSNetSocketState(MemorySegment struct) {
        return struct.get(m_eSNetSocketState$LAYOUT, m_eSNetSocketState$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int m_eSNetSocketState
     * }
     */
    public static void m_eSNetSocketState(MemorySegment struct, int fieldValue) {
        struct.set(m_eSNetSocketState$LAYOUT, m_eSNetSocketState$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

