// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct SteamInventoryEligiblePromoItemDefIDs_t {
 *     EResult m_result;
 *     CSteamID m_steamID;
 *     int m_numEligiblePromoItemDefs;
 *     bool m_bCachedData;
 * }
 * }
 */
public class SteamInventoryEligiblePromoItemDefIDs_t {

    SteamInventoryEligiblePromoItemDefIDs_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat4j.C_INT.withName("m_result"),
        MemoryLayout.paddingLayout(4),
        SteamFlat4j.C_LONG_LONG.withName("m_steamID"),
        SteamFlat4j.C_INT.withName("m_numEligiblePromoItemDefs"),
        SteamFlat4j.C_BOOL.withName("m_bCachedData"),
        MemoryLayout.paddingLayout(3)
    ).withName("SteamInventoryEligiblePromoItemDefIDs_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt m_result$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_result"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EResult m_result
     * }
     */
    public static final OfInt m_result$layout() {
        return m_result$LAYOUT;
    }

    private static final long m_result$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EResult m_result
     * }
     */
    public static final long m_result$offset() {
        return m_result$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EResult m_result
     * }
     */
    public static int m_result(MemorySegment struct) {
        return struct.get(m_result$LAYOUT, m_result$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EResult m_result
     * }
     */
    public static void m_result(MemorySegment struct, int fieldValue) {
        struct.set(m_result$LAYOUT, m_result$OFFSET, fieldValue);
    }

    private static final OfLong m_steamID$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_steamID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CSteamID m_steamID
     * }
     */
    public static final OfLong m_steamID$layout() {
        return m_steamID$LAYOUT;
    }

    private static final long m_steamID$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CSteamID m_steamID
     * }
     */
    public static final long m_steamID$offset() {
        return m_steamID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CSteamID m_steamID
     * }
     */
    public static long m_steamID(MemorySegment struct) {
        return struct.get(m_steamID$LAYOUT, m_steamID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CSteamID m_steamID
     * }
     */
    public static void m_steamID(MemorySegment struct, long fieldValue) {
        struct.set(m_steamID$LAYOUT, m_steamID$OFFSET, fieldValue);
    }

    private static final OfInt m_numEligiblePromoItemDefs$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_numEligiblePromoItemDefs"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int m_numEligiblePromoItemDefs
     * }
     */
    public static final OfInt m_numEligiblePromoItemDefs$layout() {
        return m_numEligiblePromoItemDefs$LAYOUT;
    }

    private static final long m_numEligiblePromoItemDefs$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int m_numEligiblePromoItemDefs
     * }
     */
    public static final long m_numEligiblePromoItemDefs$offset() {
        return m_numEligiblePromoItemDefs$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int m_numEligiblePromoItemDefs
     * }
     */
    public static int m_numEligiblePromoItemDefs(MemorySegment struct) {
        return struct.get(m_numEligiblePromoItemDefs$LAYOUT, m_numEligiblePromoItemDefs$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int m_numEligiblePromoItemDefs
     * }
     */
    public static void m_numEligiblePromoItemDefs(MemorySegment struct, int fieldValue) {
        struct.set(m_numEligiblePromoItemDefs$LAYOUT, m_numEligiblePromoItemDefs$OFFSET, fieldValue);
    }

    private static final OfBoolean m_bCachedData$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("m_bCachedData"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool m_bCachedData
     * }
     */
    public static final OfBoolean m_bCachedData$layout() {
        return m_bCachedData$LAYOUT;
    }

    private static final long m_bCachedData$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool m_bCachedData
     * }
     */
    public static final long m_bCachedData$offset() {
        return m_bCachedData$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool m_bCachedData
     * }
     */
    public static boolean m_bCachedData(MemorySegment struct) {
        return struct.get(m_bCachedData$LAYOUT, m_bCachedData$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool m_bCachedData
     * }
     */
    public static void m_bCachedData(MemorySegment struct, boolean fieldValue) {
        struct.set(m_bCachedData$LAYOUT, m_bCachedData$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

