// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct SteamNetConnectionStatusChangedCallback_t {
 *     HSteamNetConnection m_hConn;
 *     SteamNetConnectionInfo_t m_info;
 *     ESteamNetworkingConnectionState m_eOldState;
 * }
 * }
 */
public class SteamNetConnectionStatusChangedCallback_t {

    SteamNetConnectionStatusChangedCallback_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat4j.C_INT.withName("m_hConn"),
        MemoryLayout.paddingLayout(4),
        SteamNetConnectionInfo_t.layout().withName("m_info"),
        SteamFlat4j.C_INT.withName("m_eOldState"),
        MemoryLayout.paddingLayout(4)
    ).withName("SteamNetConnectionStatusChangedCallback_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt m_hConn$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_hConn"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * HSteamNetConnection m_hConn
     * }
     */
    public static final OfInt m_hConn$layout() {
        return m_hConn$LAYOUT;
    }

    private static final long m_hConn$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * HSteamNetConnection m_hConn
     * }
     */
    public static final long m_hConn$offset() {
        return m_hConn$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * HSteamNetConnection m_hConn
     * }
     */
    public static int m_hConn(MemorySegment struct) {
        return struct.get(m_hConn$LAYOUT, m_hConn$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * HSteamNetConnection m_hConn
     * }
     */
    public static void m_hConn(MemorySegment struct, int fieldValue) {
        struct.set(m_hConn$LAYOUT, m_hConn$OFFSET, fieldValue);
    }

    private static final GroupLayout m_info$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("m_info"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * SteamNetConnectionInfo_t m_info
     * }
     */
    public static final GroupLayout m_info$layout() {
        return m_info$LAYOUT;
    }

    private static final long m_info$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * SteamNetConnectionInfo_t m_info
     * }
     */
    public static final long m_info$offset() {
        return m_info$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * SteamNetConnectionInfo_t m_info
     * }
     */
    public static MemorySegment m_info(MemorySegment struct) {
        return struct.asSlice(m_info$OFFSET, m_info$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * SteamNetConnectionInfo_t m_info
     * }
     */
    public static void m_info(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, m_info$OFFSET, m_info$LAYOUT.byteSize());
    }

    private static final OfInt m_eOldState$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_eOldState"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ESteamNetworkingConnectionState m_eOldState
     * }
     */
    public static final OfInt m_eOldState$layout() {
        return m_eOldState$LAYOUT;
    }

    private static final long m_eOldState$OFFSET = 704;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ESteamNetworkingConnectionState m_eOldState
     * }
     */
    public static final long m_eOldState$offset() {
        return m_eOldState$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ESteamNetworkingConnectionState m_eOldState
     * }
     */
    public static int m_eOldState(MemorySegment struct) {
        return struct.get(m_eOldState$LAYOUT, m_eOldState$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ESteamNetworkingConnectionState m_eOldState
     * }
     */
    public static void m_eOldState(MemorySegment struct, int fieldValue) {
        struct.set(m_eOldState$LAYOUT, m_eOldState$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

