// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct GameConnectedChatLeave_t {
 *     CSteamID m_steamIDClanChat;
 *     CSteamID m_steamIDUser;
 *     bool m_bKicked;
 *     bool m_bDropped;
 * }
 * }
 */
public class GameConnectedChatLeave_t {

    GameConnectedChatLeave_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat.C_LONG_LONG.withName("m_steamIDClanChat"),
        SteamFlat.C_LONG_LONG.withName("m_steamIDUser"),
        SteamFlat.C_BOOL.withName("m_bKicked"),
        SteamFlat.C_BOOL.withName("m_bDropped"),
        MemoryLayout.paddingLayout(6)
    ).withName("GameConnectedChatLeave_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong m_steamIDClanChat$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_steamIDClanChat"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDClanChat
     * }
     */
    public static final OfLong m_steamIDClanChat$layout() {
        return m_steamIDClanChat$LAYOUT;
    }

    private static final long m_steamIDClanChat$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDClanChat
     * }
     */
    public static final long m_steamIDClanChat$offset() {
        return m_steamIDClanChat$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDClanChat
     * }
     */
    public static long m_steamIDClanChat(MemorySegment struct) {
        return struct.get(m_steamIDClanChat$LAYOUT, m_steamIDClanChat$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDClanChat
     * }
     */
    public static void m_steamIDClanChat(MemorySegment struct, long fieldValue) {
        struct.set(m_steamIDClanChat$LAYOUT, m_steamIDClanChat$OFFSET, fieldValue);
    }

    private static final OfLong m_steamIDUser$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_steamIDUser"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDUser
     * }
     */
    public static final OfLong m_steamIDUser$layout() {
        return m_steamIDUser$LAYOUT;
    }

    private static final long m_steamIDUser$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDUser
     * }
     */
    public static final long m_steamIDUser$offset() {
        return m_steamIDUser$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDUser
     * }
     */
    public static long m_steamIDUser(MemorySegment struct) {
        return struct.get(m_steamIDUser$LAYOUT, m_steamIDUser$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CSteamID m_steamIDUser
     * }
     */
    public static void m_steamIDUser(MemorySegment struct, long fieldValue) {
        struct.set(m_steamIDUser$LAYOUT, m_steamIDUser$OFFSET, fieldValue);
    }

    private static final OfBoolean m_bKicked$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("m_bKicked"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool m_bKicked
     * }
     */
    public static final OfBoolean m_bKicked$layout() {
        return m_bKicked$LAYOUT;
    }

    private static final long m_bKicked$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool m_bKicked
     * }
     */
    public static final long m_bKicked$offset() {
        return m_bKicked$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool m_bKicked
     * }
     */
    public static boolean m_bKicked(MemorySegment struct) {
        return struct.get(m_bKicked$LAYOUT, m_bKicked$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool m_bKicked
     * }
     */
    public static void m_bKicked(MemorySegment struct, boolean fieldValue) {
        struct.set(m_bKicked$LAYOUT, m_bKicked$OFFSET, fieldValue);
    }

    private static final OfBoolean m_bDropped$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("m_bDropped"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool m_bDropped
     * }
     */
    public static final OfBoolean m_bDropped$layout() {
        return m_bDropped$LAYOUT;
    }

    private static final long m_bDropped$OFFSET = 17;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool m_bDropped
     * }
     */
    public static final long m_bDropped$offset() {
        return m_bDropped$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool m_bDropped
     * }
     */
    public static boolean m_bDropped(MemorySegment struct) {
        return struct.get(m_bDropped$LAYOUT, m_bDropped$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool m_bDropped
     * }
     */
    public static void m_bDropped(MemorySegment struct, boolean fieldValue) {
        struct.set(m_bDropped$LAYOUT, m_bDropped$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

