// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct HTTPRequestDataReceived_t {
 *     HTTPRequestHandle m_hRequest;
 *     uint64 m_ulContextValue;
 *     uint32 m_cOffset;
 *     uint32 m_cBytesReceived;
 * }
 * }
 */
public class HTTPRequestDataReceived_t {

    HTTPRequestDataReceived_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat.C_INT.withName("m_hRequest"),
        MemoryLayout.paddingLayout(4),
        SteamFlat.C_LONG_LONG.withName("m_ulContextValue"),
        SteamFlat.C_INT.withName("m_cOffset"),
        SteamFlat.C_INT.withName("m_cBytesReceived")
    ).withName("HTTPRequestDataReceived_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt m_hRequest$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_hRequest"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * HTTPRequestHandle m_hRequest
     * }
     */
    public static final OfInt m_hRequest$layout() {
        return m_hRequest$LAYOUT;
    }

    private static final long m_hRequest$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * HTTPRequestHandle m_hRequest
     * }
     */
    public static final long m_hRequest$offset() {
        return m_hRequest$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * HTTPRequestHandle m_hRequest
     * }
     */
    public static int m_hRequest(MemorySegment struct) {
        return struct.get(m_hRequest$LAYOUT, m_hRequest$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * HTTPRequestHandle m_hRequest
     * }
     */
    public static void m_hRequest(MemorySegment struct, int fieldValue) {
        struct.set(m_hRequest$LAYOUT, m_hRequest$OFFSET, fieldValue);
    }

    private static final OfLong m_ulContextValue$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulContextValue"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64 m_ulContextValue
     * }
     */
    public static final OfLong m_ulContextValue$layout() {
        return m_ulContextValue$LAYOUT;
    }

    private static final long m_ulContextValue$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64 m_ulContextValue
     * }
     */
    public static final long m_ulContextValue$offset() {
        return m_ulContextValue$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64 m_ulContextValue
     * }
     */
    public static long m_ulContextValue(MemorySegment struct) {
        return struct.get(m_ulContextValue$LAYOUT, m_ulContextValue$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64 m_ulContextValue
     * }
     */
    public static void m_ulContextValue(MemorySegment struct, long fieldValue) {
        struct.set(m_ulContextValue$LAYOUT, m_ulContextValue$OFFSET, fieldValue);
    }

    private static final OfInt m_cOffset$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_cOffset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 m_cOffset
     * }
     */
    public static final OfInt m_cOffset$layout() {
        return m_cOffset$LAYOUT;
    }

    private static final long m_cOffset$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 m_cOffset
     * }
     */
    public static final long m_cOffset$offset() {
        return m_cOffset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 m_cOffset
     * }
     */
    public static int m_cOffset(MemorySegment struct) {
        return struct.get(m_cOffset$LAYOUT, m_cOffset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 m_cOffset
     * }
     */
    public static void m_cOffset(MemorySegment struct, int fieldValue) {
        struct.set(m_cOffset$LAYOUT, m_cOffset$OFFSET, fieldValue);
    }

    private static final OfInt m_cBytesReceived$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_cBytesReceived"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 m_cBytesReceived
     * }
     */
    public static final OfInt m_cBytesReceived$layout() {
        return m_cBytesReceived$LAYOUT;
    }

    private static final long m_cBytesReceived$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 m_cBytesReceived
     * }
     */
    public static final long m_cBytesReceived$offset() {
        return m_cBytesReceived$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 m_cBytesReceived
     * }
     */
    public static int m_cBytesReceived(MemorySegment struct) {
        return struct.get(m_cBytesReceived$LAYOUT, m_cBytesReceived$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 m_cBytesReceived
     * }
     */
    public static void m_cBytesReceived(MemorySegment struct, int fieldValue) {
        struct.set(m_cBytesReceived$LAYOUT, m_cBytesReceived$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

