// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct JoinPartyCallback_t {
 *     EResult m_eResult;
 *     PartyBeaconID_t m_ulBeaconID;
 *     CSteamID m_SteamIDBeaconOwner;
 *     char m_rgchConnectString[256];
 * }
 * }
 */
public class JoinPartyCallback_t {

    JoinPartyCallback_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat.C_INT.withName("m_eResult"),
        MemoryLayout.paddingLayout(4),
        SteamFlat.C_LONG_LONG.withName("m_ulBeaconID"),
        SteamFlat.C_LONG_LONG.withName("m_SteamIDBeaconOwner"),
        MemoryLayout.sequenceLayout(256, SteamFlat.C_CHAR).withName("m_rgchConnectString")
    ).withName("JoinPartyCallback_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt m_eResult$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_eResult"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final OfInt m_eResult$layout() {
        return m_eResult$LAYOUT;
    }

    private static final long m_eResult$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final long m_eResult$offset() {
        return m_eResult$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static int m_eResult(MemorySegment struct) {
        return struct.get(m_eResult$LAYOUT, m_eResult$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static void m_eResult(MemorySegment struct, int fieldValue) {
        struct.set(m_eResult$LAYOUT, m_eResult$OFFSET, fieldValue);
    }

    private static final OfLong m_ulBeaconID$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulBeaconID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PartyBeaconID_t m_ulBeaconID
     * }
     */
    public static final OfLong m_ulBeaconID$layout() {
        return m_ulBeaconID$LAYOUT;
    }

    private static final long m_ulBeaconID$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PartyBeaconID_t m_ulBeaconID
     * }
     */
    public static final long m_ulBeaconID$offset() {
        return m_ulBeaconID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PartyBeaconID_t m_ulBeaconID
     * }
     */
    public static long m_ulBeaconID(MemorySegment struct) {
        return struct.get(m_ulBeaconID$LAYOUT, m_ulBeaconID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PartyBeaconID_t m_ulBeaconID
     * }
     */
    public static void m_ulBeaconID(MemorySegment struct, long fieldValue) {
        struct.set(m_ulBeaconID$LAYOUT, m_ulBeaconID$OFFSET, fieldValue);
    }

    private static final OfLong m_SteamIDBeaconOwner$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_SteamIDBeaconOwner"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CSteamID m_SteamIDBeaconOwner
     * }
     */
    public static final OfLong m_SteamIDBeaconOwner$layout() {
        return m_SteamIDBeaconOwner$LAYOUT;
    }

    private static final long m_SteamIDBeaconOwner$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CSteamID m_SteamIDBeaconOwner
     * }
     */
    public static final long m_SteamIDBeaconOwner$offset() {
        return m_SteamIDBeaconOwner$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CSteamID m_SteamIDBeaconOwner
     * }
     */
    public static long m_SteamIDBeaconOwner(MemorySegment struct) {
        return struct.get(m_SteamIDBeaconOwner$LAYOUT, m_SteamIDBeaconOwner$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CSteamID m_SteamIDBeaconOwner
     * }
     */
    public static void m_SteamIDBeaconOwner(MemorySegment struct, long fieldValue) {
        struct.set(m_SteamIDBeaconOwner$LAYOUT, m_SteamIDBeaconOwner$OFFSET, fieldValue);
    }

    private static final SequenceLayout m_rgchConnectString$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("m_rgchConnectString"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char m_rgchConnectString[256]
     * }
     */
    public static final SequenceLayout m_rgchConnectString$layout() {
        return m_rgchConnectString$LAYOUT;
    }

    private static final long m_rgchConnectString$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char m_rgchConnectString[256]
     * }
     */
    public static final long m_rgchConnectString$offset() {
        return m_rgchConnectString$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char m_rgchConnectString[256]
     * }
     */
    public static MemorySegment m_rgchConnectString(MemorySegment struct) {
        return struct.asSlice(m_rgchConnectString$OFFSET, m_rgchConnectString$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char m_rgchConnectString[256]
     * }
     */
    public static void m_rgchConnectString(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, m_rgchConnectString$OFFSET, m_rgchConnectString$LAYOUT.byteSize());
    }

    private static long[] m_rgchConnectString$DIMS = { 256 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char m_rgchConnectString[256]
     * }
     */
    public static long[] m_rgchConnectString$dimensions() {
        return m_rgchConnectString$DIMS;
    }
    private static final VarHandle m_rgchConnectString$ELEM_HANDLE = m_rgchConnectString$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char m_rgchConnectString[256]
     * }
     */
    public static byte m_rgchConnectString(MemorySegment struct, long index0) {
        return (byte)m_rgchConnectString$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char m_rgchConnectString[256]
     * }
     */
    public static void m_rgchConnectString(MemorySegment struct, long index0, byte fieldValue) {
        m_rgchConnectString$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

