// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct LobbyGameCreated_t {
 *     uint64 m_ulSteamIDLobby;
 *     uint64 m_ulSteamIDGameServer;
 *     uint32 m_unIP;
 *     uint16 m_usPort;
 * }
 * }
 */
public class LobbyGameCreated_t {

    LobbyGameCreated_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat.C_LONG_LONG.withName("m_ulSteamIDLobby"),
        SteamFlat.C_LONG_LONG.withName("m_ulSteamIDGameServer"),
        SteamFlat.C_INT.withName("m_unIP"),
        SteamFlat.C_SHORT.withName("m_usPort"),
        MemoryLayout.paddingLayout(2)
    ).withName("LobbyGameCreated_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong m_ulSteamIDLobby$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulSteamIDLobby"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static final OfLong m_ulSteamIDLobby$layout() {
        return m_ulSteamIDLobby$LAYOUT;
    }

    private static final long m_ulSteamIDLobby$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static final long m_ulSteamIDLobby$offset() {
        return m_ulSteamIDLobby$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static long m_ulSteamIDLobby(MemorySegment struct) {
        return struct.get(m_ulSteamIDLobby$LAYOUT, m_ulSteamIDLobby$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static void m_ulSteamIDLobby(MemorySegment struct, long fieldValue) {
        struct.set(m_ulSteamIDLobby$LAYOUT, m_ulSteamIDLobby$OFFSET, fieldValue);
    }

    private static final OfLong m_ulSteamIDGameServer$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulSteamIDGameServer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDGameServer
     * }
     */
    public static final OfLong m_ulSteamIDGameServer$layout() {
        return m_ulSteamIDGameServer$LAYOUT;
    }

    private static final long m_ulSteamIDGameServer$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDGameServer
     * }
     */
    public static final long m_ulSteamIDGameServer$offset() {
        return m_ulSteamIDGameServer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDGameServer
     * }
     */
    public static long m_ulSteamIDGameServer(MemorySegment struct) {
        return struct.get(m_ulSteamIDGameServer$LAYOUT, m_ulSteamIDGameServer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDGameServer
     * }
     */
    public static void m_ulSteamIDGameServer(MemorySegment struct, long fieldValue) {
        struct.set(m_ulSteamIDGameServer$LAYOUT, m_ulSteamIDGameServer$OFFSET, fieldValue);
    }

    private static final OfInt m_unIP$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_unIP"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 m_unIP
     * }
     */
    public static final OfInt m_unIP$layout() {
        return m_unIP$LAYOUT;
    }

    private static final long m_unIP$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 m_unIP
     * }
     */
    public static final long m_unIP$offset() {
        return m_unIP$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 m_unIP
     * }
     */
    public static int m_unIP(MemorySegment struct) {
        return struct.get(m_unIP$LAYOUT, m_unIP$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 m_unIP
     * }
     */
    public static void m_unIP(MemorySegment struct, int fieldValue) {
        struct.set(m_unIP$LAYOUT, m_unIP$OFFSET, fieldValue);
    }

    private static final OfShort m_usPort$LAYOUT = (OfShort)$LAYOUT.select(groupElement("m_usPort"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint16 m_usPort
     * }
     */
    public static final OfShort m_usPort$layout() {
        return m_usPort$LAYOUT;
    }

    private static final long m_usPort$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint16 m_usPort
     * }
     */
    public static final long m_usPort$offset() {
        return m_usPort$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint16 m_usPort
     * }
     */
    public static short m_usPort(MemorySegment struct) {
        return struct.get(m_usPort$LAYOUT, m_usPort$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint16 m_usPort
     * }
     */
    public static void m_usPort(MemorySegment struct, short fieldValue) {
        struct.set(m_usPort$LAYOUT, m_usPort$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

