// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct LobbyChatUpdate_t {
 *     uint64 m_ulSteamIDLobby;
 *     uint64 m_ulSteamIDUserChanged;
 *     uint64 m_ulSteamIDMakingChange;
 *     uint32 m_rgfChatMemberStateChange;
 * }
 * }
 */
public class LobbyChatUpdate_t {

    LobbyChatUpdate_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat.C_LONG_LONG.withName("m_ulSteamIDLobby"),
        SteamFlat.C_LONG_LONG.withName("m_ulSteamIDUserChanged"),
        SteamFlat.C_LONG_LONG.withName("m_ulSteamIDMakingChange"),
        SteamFlat.C_INT.withName("m_rgfChatMemberStateChange"),
        MemoryLayout.paddingLayout(4)
    ).withName("LobbyChatUpdate_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong m_ulSteamIDLobby$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulSteamIDLobby"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static final OfLong m_ulSteamIDLobby$layout() {
        return m_ulSteamIDLobby$LAYOUT;
    }

    private static final long m_ulSteamIDLobby$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static final long m_ulSteamIDLobby$offset() {
        return m_ulSteamIDLobby$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static long m_ulSteamIDLobby(MemorySegment struct) {
        return struct.get(m_ulSteamIDLobby$LAYOUT, m_ulSteamIDLobby$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDLobby
     * }
     */
    public static void m_ulSteamIDLobby(MemorySegment struct, long fieldValue) {
        struct.set(m_ulSteamIDLobby$LAYOUT, m_ulSteamIDLobby$OFFSET, fieldValue);
    }

    private static final OfLong m_ulSteamIDUserChanged$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulSteamIDUserChanged"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDUserChanged
     * }
     */
    public static final OfLong m_ulSteamIDUserChanged$layout() {
        return m_ulSteamIDUserChanged$LAYOUT;
    }

    private static final long m_ulSteamIDUserChanged$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDUserChanged
     * }
     */
    public static final long m_ulSteamIDUserChanged$offset() {
        return m_ulSteamIDUserChanged$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDUserChanged
     * }
     */
    public static long m_ulSteamIDUserChanged(MemorySegment struct) {
        return struct.get(m_ulSteamIDUserChanged$LAYOUT, m_ulSteamIDUserChanged$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDUserChanged
     * }
     */
    public static void m_ulSteamIDUserChanged(MemorySegment struct, long fieldValue) {
        struct.set(m_ulSteamIDUserChanged$LAYOUT, m_ulSteamIDUserChanged$OFFSET, fieldValue);
    }

    private static final OfLong m_ulSteamIDMakingChange$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulSteamIDMakingChange"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDMakingChange
     * }
     */
    public static final OfLong m_ulSteamIDMakingChange$layout() {
        return m_ulSteamIDMakingChange$LAYOUT;
    }

    private static final long m_ulSteamIDMakingChange$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDMakingChange
     * }
     */
    public static final long m_ulSteamIDMakingChange$offset() {
        return m_ulSteamIDMakingChange$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDMakingChange
     * }
     */
    public static long m_ulSteamIDMakingChange(MemorySegment struct) {
        return struct.get(m_ulSteamIDMakingChange$LAYOUT, m_ulSteamIDMakingChange$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDMakingChange
     * }
     */
    public static void m_ulSteamIDMakingChange(MemorySegment struct, long fieldValue) {
        struct.set(m_ulSteamIDMakingChange$LAYOUT, m_ulSteamIDMakingChange$OFFSET, fieldValue);
    }

    private static final OfInt m_rgfChatMemberStateChange$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_rgfChatMemberStateChange"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 m_rgfChatMemberStateChange
     * }
     */
    public static final OfInt m_rgfChatMemberStateChange$layout() {
        return m_rgfChatMemberStateChange$LAYOUT;
    }

    private static final long m_rgfChatMemberStateChange$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 m_rgfChatMemberStateChange
     * }
     */
    public static final long m_rgfChatMemberStateChange$offset() {
        return m_rgfChatMemberStateChange$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 m_rgfChatMemberStateChange
     * }
     */
    public static int m_rgfChatMemberStateChange(MemorySegment struct) {
        return struct.get(m_rgfChatMemberStateChange$LAYOUT, m_rgfChatMemberStateChange$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 m_rgfChatMemberStateChange
     * }
     */
    public static void m_rgfChatMemberStateChange(MemorySegment struct, int fieldValue) {
        struct.set(m_rgfChatMemberStateChange$LAYOUT, m_rgfChatMemberStateChange$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

