// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct RemoteStorageFileShareResult_t {
 *     EResult m_eResult;
 *     UGCHandle_t m_hFile;
 *     char m_rgchFilename[260];
 * }
 * }
 */
public class RemoteStorageFileShareResult_t {

    RemoteStorageFileShareResult_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat.C_INT.withName("m_eResult"),
        MemoryLayout.paddingLayout(4),
        SteamFlat.C_LONG_LONG.withName("m_hFile"),
        MemoryLayout.sequenceLayout(260, SteamFlat.C_CHAR).withName("m_rgchFilename"),
        MemoryLayout.paddingLayout(4)
    ).withName("RemoteStorageFileShareResult_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt m_eResult$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_eResult"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final OfInt m_eResult$layout() {
        return m_eResult$LAYOUT;
    }

    private static final long m_eResult$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final long m_eResult$offset() {
        return m_eResult$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static int m_eResult(MemorySegment struct) {
        return struct.get(m_eResult$LAYOUT, m_eResult$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static void m_eResult(MemorySegment struct, int fieldValue) {
        struct.set(m_eResult$LAYOUT, m_eResult$OFFSET, fieldValue);
    }

    private static final OfLong m_hFile$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_hFile"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * UGCHandle_t m_hFile
     * }
     */
    public static final OfLong m_hFile$layout() {
        return m_hFile$LAYOUT;
    }

    private static final long m_hFile$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * UGCHandle_t m_hFile
     * }
     */
    public static final long m_hFile$offset() {
        return m_hFile$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * UGCHandle_t m_hFile
     * }
     */
    public static long m_hFile(MemorySegment struct) {
        return struct.get(m_hFile$LAYOUT, m_hFile$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * UGCHandle_t m_hFile
     * }
     */
    public static void m_hFile(MemorySegment struct, long fieldValue) {
        struct.set(m_hFile$LAYOUT, m_hFile$OFFSET, fieldValue);
    }

    private static final SequenceLayout m_rgchFilename$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("m_rgchFilename"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char m_rgchFilename[260]
     * }
     */
    public static final SequenceLayout m_rgchFilename$layout() {
        return m_rgchFilename$LAYOUT;
    }

    private static final long m_rgchFilename$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char m_rgchFilename[260]
     * }
     */
    public static final long m_rgchFilename$offset() {
        return m_rgchFilename$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char m_rgchFilename[260]
     * }
     */
    public static MemorySegment m_rgchFilename(MemorySegment struct) {
        return struct.asSlice(m_rgchFilename$OFFSET, m_rgchFilename$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char m_rgchFilename[260]
     * }
     */
    public static void m_rgchFilename(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, m_rgchFilename$OFFSET, m_rgchFilename$LAYOUT.byteSize());
    }

    private static long[] m_rgchFilename$DIMS = { 260 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char m_rgchFilename[260]
     * }
     */
    public static long[] m_rgchFilename$dimensions() {
        return m_rgchFilename$DIMS;
    }
    private static final VarHandle m_rgchFilename$ELEM_HANDLE = m_rgchFilename$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char m_rgchFilename[260]
     * }
     */
    public static byte m_rgchFilename(MemorySegment struct, long index0) {
        return (byte)m_rgchFilename$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char m_rgchFilename[260]
     * }
     */
    public static void m_rgchFilename(MemorySegment struct, long index0, byte fieldValue) {
        m_rgchFilename$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

