// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct RemoteStorageFileReadAsyncComplete_t {
 *     SteamAPICall_t m_hFileReadAsync;
 *     EResult m_eResult;
 *     uint32 m_nOffset;
 *     uint32 m_cubRead;
 * }
 * }
 */
public class RemoteStorageFileReadAsyncComplete_t {

    RemoteStorageFileReadAsyncComplete_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat.C_LONG_LONG.withName("m_hFileReadAsync"),
        SteamFlat.C_INT.withName("m_eResult"),
        SteamFlat.C_INT.withName("m_nOffset"),
        SteamFlat.C_INT.withName("m_cubRead"),
        MemoryLayout.paddingLayout(4)
    ).withName("RemoteStorageFileReadAsyncComplete_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong m_hFileReadAsync$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_hFileReadAsync"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * SteamAPICall_t m_hFileReadAsync
     * }
     */
    public static final OfLong m_hFileReadAsync$layout() {
        return m_hFileReadAsync$LAYOUT;
    }

    private static final long m_hFileReadAsync$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * SteamAPICall_t m_hFileReadAsync
     * }
     */
    public static final long m_hFileReadAsync$offset() {
        return m_hFileReadAsync$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * SteamAPICall_t m_hFileReadAsync
     * }
     */
    public static long m_hFileReadAsync(MemorySegment struct) {
        return struct.get(m_hFileReadAsync$LAYOUT, m_hFileReadAsync$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * SteamAPICall_t m_hFileReadAsync
     * }
     */
    public static void m_hFileReadAsync(MemorySegment struct, long fieldValue) {
        struct.set(m_hFileReadAsync$LAYOUT, m_hFileReadAsync$OFFSET, fieldValue);
    }

    private static final OfInt m_eResult$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_eResult"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final OfInt m_eResult$layout() {
        return m_eResult$LAYOUT;
    }

    private static final long m_eResult$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final long m_eResult$offset() {
        return m_eResult$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static int m_eResult(MemorySegment struct) {
        return struct.get(m_eResult$LAYOUT, m_eResult$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static void m_eResult(MemorySegment struct, int fieldValue) {
        struct.set(m_eResult$LAYOUT, m_eResult$OFFSET, fieldValue);
    }

    private static final OfInt m_nOffset$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_nOffset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 m_nOffset
     * }
     */
    public static final OfInt m_nOffset$layout() {
        return m_nOffset$LAYOUT;
    }

    private static final long m_nOffset$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 m_nOffset
     * }
     */
    public static final long m_nOffset$offset() {
        return m_nOffset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 m_nOffset
     * }
     */
    public static int m_nOffset(MemorySegment struct) {
        return struct.get(m_nOffset$LAYOUT, m_nOffset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 m_nOffset
     * }
     */
    public static void m_nOffset(MemorySegment struct, int fieldValue) {
        struct.set(m_nOffset$LAYOUT, m_nOffset$OFFSET, fieldValue);
    }

    private static final OfInt m_cubRead$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_cubRead"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 m_cubRead
     * }
     */
    public static final OfInt m_cubRead$layout() {
        return m_cubRead$LAYOUT;
    }

    private static final long m_cubRead$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 m_cubRead
     * }
     */
    public static final long m_cubRead$offset() {
        return m_cubRead$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 m_cubRead
     * }
     */
    public static int m_cubRead(MemorySegment struct) {
        return struct.get(m_cubRead$LAYOUT, m_cubRead$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 m_cubRead
     * }
     */
    public static void m_cubRead(MemorySegment struct, int fieldValue) {
        struct.set(m_cubRead$LAYOUT, m_cubRead$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

