// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct RemoteStorageDownloadUGCResult_t {
 *     EResult m_eResult;
 *     UGCHandle_t m_hFile;
 *     AppId_t m_nAppID;
 *     int32 m_nSizeInBytes;
 *     char m_pchFileName[260];
 *     uint64 m_ulSteamIDOwner;
 * }
 * }
 */
public class RemoteStorageDownloadUGCResult_t {

    RemoteStorageDownloadUGCResult_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat.C_INT.withName("m_eResult"),
        MemoryLayout.paddingLayout(4),
        SteamFlat.C_LONG_LONG.withName("m_hFile"),
        SteamFlat.C_INT.withName("m_nAppID"),
        SteamFlat.C_INT.withName("m_nSizeInBytes"),
        MemoryLayout.sequenceLayout(260, SteamFlat.C_CHAR).withName("m_pchFileName"),
        MemoryLayout.paddingLayout(4),
        SteamFlat.C_LONG_LONG.withName("m_ulSteamIDOwner")
    ).withName("RemoteStorageDownloadUGCResult_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt m_eResult$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_eResult"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final OfInt m_eResult$layout() {
        return m_eResult$LAYOUT;
    }

    private static final long m_eResult$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static final long m_eResult$offset() {
        return m_eResult$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static int m_eResult(MemorySegment struct) {
        return struct.get(m_eResult$LAYOUT, m_eResult$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EResult m_eResult
     * }
     */
    public static void m_eResult(MemorySegment struct, int fieldValue) {
        struct.set(m_eResult$LAYOUT, m_eResult$OFFSET, fieldValue);
    }

    private static final OfLong m_hFile$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_hFile"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * UGCHandle_t m_hFile
     * }
     */
    public static final OfLong m_hFile$layout() {
        return m_hFile$LAYOUT;
    }

    private static final long m_hFile$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * UGCHandle_t m_hFile
     * }
     */
    public static final long m_hFile$offset() {
        return m_hFile$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * UGCHandle_t m_hFile
     * }
     */
    public static long m_hFile(MemorySegment struct) {
        return struct.get(m_hFile$LAYOUT, m_hFile$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * UGCHandle_t m_hFile
     * }
     */
    public static void m_hFile(MemorySegment struct, long fieldValue) {
        struct.set(m_hFile$LAYOUT, m_hFile$OFFSET, fieldValue);
    }

    private static final OfInt m_nAppID$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_nAppID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * AppId_t m_nAppID
     * }
     */
    public static final OfInt m_nAppID$layout() {
        return m_nAppID$LAYOUT;
    }

    private static final long m_nAppID$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * AppId_t m_nAppID
     * }
     */
    public static final long m_nAppID$offset() {
        return m_nAppID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * AppId_t m_nAppID
     * }
     */
    public static int m_nAppID(MemorySegment struct) {
        return struct.get(m_nAppID$LAYOUT, m_nAppID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * AppId_t m_nAppID
     * }
     */
    public static void m_nAppID(MemorySegment struct, int fieldValue) {
        struct.set(m_nAppID$LAYOUT, m_nAppID$OFFSET, fieldValue);
    }

    private static final OfInt m_nSizeInBytes$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_nSizeInBytes"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32 m_nSizeInBytes
     * }
     */
    public static final OfInt m_nSizeInBytes$layout() {
        return m_nSizeInBytes$LAYOUT;
    }

    private static final long m_nSizeInBytes$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32 m_nSizeInBytes
     * }
     */
    public static final long m_nSizeInBytes$offset() {
        return m_nSizeInBytes$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32 m_nSizeInBytes
     * }
     */
    public static int m_nSizeInBytes(MemorySegment struct) {
        return struct.get(m_nSizeInBytes$LAYOUT, m_nSizeInBytes$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32 m_nSizeInBytes
     * }
     */
    public static void m_nSizeInBytes(MemorySegment struct, int fieldValue) {
        struct.set(m_nSizeInBytes$LAYOUT, m_nSizeInBytes$OFFSET, fieldValue);
    }

    private static final SequenceLayout m_pchFileName$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("m_pchFileName"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char m_pchFileName[260]
     * }
     */
    public static final SequenceLayout m_pchFileName$layout() {
        return m_pchFileName$LAYOUT;
    }

    private static final long m_pchFileName$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char m_pchFileName[260]
     * }
     */
    public static final long m_pchFileName$offset() {
        return m_pchFileName$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char m_pchFileName[260]
     * }
     */
    public static MemorySegment m_pchFileName(MemorySegment struct) {
        return struct.asSlice(m_pchFileName$OFFSET, m_pchFileName$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char m_pchFileName[260]
     * }
     */
    public static void m_pchFileName(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, m_pchFileName$OFFSET, m_pchFileName$LAYOUT.byteSize());
    }

    private static long[] m_pchFileName$DIMS = { 260 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char m_pchFileName[260]
     * }
     */
    public static long[] m_pchFileName$dimensions() {
        return m_pchFileName$DIMS;
    }
    private static final VarHandle m_pchFileName$ELEM_HANDLE = m_pchFileName$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char m_pchFileName[260]
     * }
     */
    public static byte m_pchFileName(MemorySegment struct, long index0) {
        return (byte)m_pchFileName$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char m_pchFileName[260]
     * }
     */
    public static void m_pchFileName(MemorySegment struct, long index0, byte fieldValue) {
        m_pchFileName$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfLong m_ulSteamIDOwner$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulSteamIDOwner"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDOwner
     * }
     */
    public static final OfLong m_ulSteamIDOwner$layout() {
        return m_ulSteamIDOwner$LAYOUT;
    }

    private static final long m_ulSteamIDOwner$OFFSET = 288;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDOwner
     * }
     */
    public static final long m_ulSteamIDOwner$offset() {
        return m_ulSteamIDOwner$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDOwner
     * }
     */
    public static long m_ulSteamIDOwner(MemorySegment struct) {
        return struct.get(m_ulSteamIDOwner$LAYOUT, m_ulSteamIDOwner$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64 m_ulSteamIDOwner
     * }
     */
    public static void m_ulSteamIDOwner(MemorySegment struct, long fieldValue) {
        struct.set(m_ulSteamIDOwner$LAYOUT, m_ulSteamIDOwner$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

