// Generated by jextract

package steamflat4j;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct SteamInputConfigurationLoaded_t {
 *     AppId_t m_unAppID;
 *     InputHandle_t m_ulDeviceHandle;
 *     CSteamID m_ulMappingCreator;
 *     uint32 m_unMajorRevision;
 *     uint32 m_unMinorRevision;
 *     bool m_bUsesSteamInputAPI;
 *     bool m_bUsesGamepadAPI;
 * }
 * }
 */
public class SteamInputConfigurationLoaded_t {

    SteamInputConfigurationLoaded_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        SteamFlat.C_INT.withName("m_unAppID"),
        MemoryLayout.paddingLayout(4),
        SteamFlat.C_LONG_LONG.withName("m_ulDeviceHandle"),
        SteamFlat.C_LONG_LONG.withName("m_ulMappingCreator"),
        SteamFlat.C_INT.withName("m_unMajorRevision"),
        SteamFlat.C_INT.withName("m_unMinorRevision"),
        SteamFlat.C_BOOL.withName("m_bUsesSteamInputAPI"),
        SteamFlat.C_BOOL.withName("m_bUsesGamepadAPI"),
        MemoryLayout.paddingLayout(6)
    ).withName("SteamInputConfigurationLoaded_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt m_unAppID$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_unAppID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * AppId_t m_unAppID
     * }
     */
    public static final OfInt m_unAppID$layout() {
        return m_unAppID$LAYOUT;
    }

    private static final long m_unAppID$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * AppId_t m_unAppID
     * }
     */
    public static final long m_unAppID$offset() {
        return m_unAppID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * AppId_t m_unAppID
     * }
     */
    public static int m_unAppID(MemorySegment struct) {
        return struct.get(m_unAppID$LAYOUT, m_unAppID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * AppId_t m_unAppID
     * }
     */
    public static void m_unAppID(MemorySegment struct, int fieldValue) {
        struct.set(m_unAppID$LAYOUT, m_unAppID$OFFSET, fieldValue);
    }

    private static final OfLong m_ulDeviceHandle$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulDeviceHandle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * InputHandle_t m_ulDeviceHandle
     * }
     */
    public static final OfLong m_ulDeviceHandle$layout() {
        return m_ulDeviceHandle$LAYOUT;
    }

    private static final long m_ulDeviceHandle$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * InputHandle_t m_ulDeviceHandle
     * }
     */
    public static final long m_ulDeviceHandle$offset() {
        return m_ulDeviceHandle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * InputHandle_t m_ulDeviceHandle
     * }
     */
    public static long m_ulDeviceHandle(MemorySegment struct) {
        return struct.get(m_ulDeviceHandle$LAYOUT, m_ulDeviceHandle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * InputHandle_t m_ulDeviceHandle
     * }
     */
    public static void m_ulDeviceHandle(MemorySegment struct, long fieldValue) {
        struct.set(m_ulDeviceHandle$LAYOUT, m_ulDeviceHandle$OFFSET, fieldValue);
    }

    private static final OfLong m_ulMappingCreator$LAYOUT = (OfLong)$LAYOUT.select(groupElement("m_ulMappingCreator"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CSteamID m_ulMappingCreator
     * }
     */
    public static final OfLong m_ulMappingCreator$layout() {
        return m_ulMappingCreator$LAYOUT;
    }

    private static final long m_ulMappingCreator$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CSteamID m_ulMappingCreator
     * }
     */
    public static final long m_ulMappingCreator$offset() {
        return m_ulMappingCreator$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CSteamID m_ulMappingCreator
     * }
     */
    public static long m_ulMappingCreator(MemorySegment struct) {
        return struct.get(m_ulMappingCreator$LAYOUT, m_ulMappingCreator$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CSteamID m_ulMappingCreator
     * }
     */
    public static void m_ulMappingCreator(MemorySegment struct, long fieldValue) {
        struct.set(m_ulMappingCreator$LAYOUT, m_ulMappingCreator$OFFSET, fieldValue);
    }

    private static final OfInt m_unMajorRevision$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_unMajorRevision"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 m_unMajorRevision
     * }
     */
    public static final OfInt m_unMajorRevision$layout() {
        return m_unMajorRevision$LAYOUT;
    }

    private static final long m_unMajorRevision$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 m_unMajorRevision
     * }
     */
    public static final long m_unMajorRevision$offset() {
        return m_unMajorRevision$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 m_unMajorRevision
     * }
     */
    public static int m_unMajorRevision(MemorySegment struct) {
        return struct.get(m_unMajorRevision$LAYOUT, m_unMajorRevision$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 m_unMajorRevision
     * }
     */
    public static void m_unMajorRevision(MemorySegment struct, int fieldValue) {
        struct.set(m_unMajorRevision$LAYOUT, m_unMajorRevision$OFFSET, fieldValue);
    }

    private static final OfInt m_unMinorRevision$LAYOUT = (OfInt)$LAYOUT.select(groupElement("m_unMinorRevision"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32 m_unMinorRevision
     * }
     */
    public static final OfInt m_unMinorRevision$layout() {
        return m_unMinorRevision$LAYOUT;
    }

    private static final long m_unMinorRevision$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32 m_unMinorRevision
     * }
     */
    public static final long m_unMinorRevision$offset() {
        return m_unMinorRevision$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32 m_unMinorRevision
     * }
     */
    public static int m_unMinorRevision(MemorySegment struct) {
        return struct.get(m_unMinorRevision$LAYOUT, m_unMinorRevision$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32 m_unMinorRevision
     * }
     */
    public static void m_unMinorRevision(MemorySegment struct, int fieldValue) {
        struct.set(m_unMinorRevision$LAYOUT, m_unMinorRevision$OFFSET, fieldValue);
    }

    private static final OfBoolean m_bUsesSteamInputAPI$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("m_bUsesSteamInputAPI"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool m_bUsesSteamInputAPI
     * }
     */
    public static final OfBoolean m_bUsesSteamInputAPI$layout() {
        return m_bUsesSteamInputAPI$LAYOUT;
    }

    private static final long m_bUsesSteamInputAPI$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool m_bUsesSteamInputAPI
     * }
     */
    public static final long m_bUsesSteamInputAPI$offset() {
        return m_bUsesSteamInputAPI$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool m_bUsesSteamInputAPI
     * }
     */
    public static boolean m_bUsesSteamInputAPI(MemorySegment struct) {
        return struct.get(m_bUsesSteamInputAPI$LAYOUT, m_bUsesSteamInputAPI$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool m_bUsesSteamInputAPI
     * }
     */
    public static void m_bUsesSteamInputAPI(MemorySegment struct, boolean fieldValue) {
        struct.set(m_bUsesSteamInputAPI$LAYOUT, m_bUsesSteamInputAPI$OFFSET, fieldValue);
    }

    private static final OfBoolean m_bUsesGamepadAPI$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("m_bUsesGamepadAPI"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool m_bUsesGamepadAPI
     * }
     */
    public static final OfBoolean m_bUsesGamepadAPI$layout() {
        return m_bUsesGamepadAPI$LAYOUT;
    }

    private static final long m_bUsesGamepadAPI$OFFSET = 33;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool m_bUsesGamepadAPI
     * }
     */
    public static final long m_bUsesGamepadAPI$offset() {
        return m_bUsesGamepadAPI$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool m_bUsesGamepadAPI
     * }
     */
    public static boolean m_bUsesGamepadAPI(MemorySegment struct) {
        return struct.get(m_bUsesGamepadAPI$LAYOUT, m_bUsesGamepadAPI$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool m_bUsesGamepadAPI
     * }
     */
    public static void m_bUsesGamepadAPI(MemorySegment struct, boolean fieldValue) {
        struct.set(m_bUsesGamepadAPI$LAYOUT, m_bUsesGamepadAPI$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

